# PreferDimSideUiFilter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PreferDimSideUiFilter Property
ParameterTypeId Class See Also
---
"Prefer:": This is used by the UI to allow select prefer dimension side.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PreferDimSideUiFilter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PreferDimSideUiFilter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PreferDimSideUiFilter {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace